In [16]:

#CCCCOOOOOMMMMPPPPLLLLEEEETTTTAAAARRRR



%reset
%reload_ext sql
%sql sqlite:///e1.db

Once deleted, variables cannot be recovered. Proceed (y/[n])? y

'Connected: None@e1.db'

In [17]:
%%sql CREATE TABLE Profesores(nif CHAR(30),
                            PRIMARY KEY (nif));

Done.

[]

In [18]:
%%sql CREATE TABLE Asignaturas(codigo INT NOT NULL,
                               PRIMARY KEY (codigo));

Done.

[]

In [19]:
%sql CREATE TABLE Cuatrimestre(fecha VARCHAR(12));

Done.

[]

In [20]:
%%sql CREATE TABLE Ense単a(nif CHAR(30),
                         codigo INT NOT NULL,
                         fecha VARCHAR(12),
                         PRIMARY KEY(nif, codigo, fecha),
                         FOREIGN KEY(nif) REFERENCES Profesores (nif),
                         FOREIGN KEY(codigo) REFERENCES Asignaturas (codigo),
                         FOREIGN KEY(fecha) REFERENCES Cuatrimestre (fecha));

Done.

[]

In [21]:
%%sql INSERT INTO Profesores(nif)
    VALUES('1234234N');

1 rows affected.

[]

In [22]:
%%sql INSERT INTO Asignaturas(codigo)
    VALUES(223);

1 rows affected.

[]

In [23]:
%%sql INSERT INTO Ense単a(nif, codigo)
    VALUES('1234234N', 223);

1 rows affected.

[]

In [24]:
%sql SELECT * FROM Profesores

Done.

[('1234234N',)]

In [28]:
%sql SELECT * FROM Ense単a

Done.

[('1234234N', 223, None)]

In [15]:
%sql DROP TABLE Profesores
%sql DROP TABLE Asignaturas
%sql DROP TABLE Cuatrimestre
%sql DROP TABLE Ense単a

Done.
Done.
Done.
Done.

[]